/*
4. Найти группы, в которых в 2011 году было менее 5 обучающихся студентов на ФКТИУ.
Для реализации использовать подзапрос.
*/
SELECT Н_УЧЕНИКИ.ГРУППА, count(Н_УЧЕНИКИ.ГРУППА) as КОЛВО_УЧЕНИКОВ
FROM Н_УЧЕНИКИ
WHERE EXTRACT(YEAR FROM Н_УЧЕНИКИ.КОНЕЦ)>=2011 AND
EXTRACT(YEAR FROM Н_УЧЕНИКИ.НАЧАЛО)<=2011 AND
ГРУППА IN (
	SELECT Н_ГРУППЫ_ПЛАНОВ.ГРУППА
 	FROM Н_ПЛАНЫ
	JOIN Н_ОТДЕЛЫ ON Н_ПЛАНЫ.ОТД_ИД = Н_ОТДЕЛЫ.ИД
	JOIN Н_ГРУППЫ_ПЛАНОВ ON Н_ПЛАНЫ.ИД = Н_ГРУППЫ_ПЛАНОВ.ПЛАН_ИД
	WHERE Н_ОТДЕЛЫ.КОРОТКОЕ_ИМЯ = 'КТиУ'
)
GROUP BY Н_УЧЕНИКИ.ГРУППА
HAVING count(Н_УЧЕНИКИ.ГРУППА) < 5;

/*
Результат:
 ГРУППА | КОЛВО_УЧЕНИКОВ
--------+----------------
 551    |              4
 555    |              2
 439    |              1
 218    |              3
 455    |              1
 139    |              2
 5103   |              1
 553    |              2
 1102   |              4
 419    |              2
 5109   |              4
 5115   |              2
 319    |              1
 155    |              3
 552    |              2
 4102   |              3
 238    |              3
 3121   |              1
 353    |              2
 450    |              2
 4121   |              1
 255    |              2
 239    |              4
 5121   |              1
 539    |              1
 438    |              1
 2102   |              4
(27 строк)
*/
