/*
6. Получить список студентов, отчисленных после первого сентября 2012 года с заочной формы обучения. В результат включить:
номер группы;
номер, фамилию, имя и отчество студента;
номер пункта приказа;
Для реализации использовать подзапрос с IN.
*/

SELECT Н_УЧЕНИКИ.ГРУППА, Н_ЛЮДИ.ИД, Н_ЛЮДИ.ФАМИЛИЯ, Н_ЛЮДИ.ИМЯ, Н_ЛЮДИ.ОТЧЕСТВО, Н_УЧЕНИКИ.В_СВЯЗИ_С
FROM Н_ЛЮДИ
JOIN Н_УЧЕНИКИ ON Н_ЛЮДИ.ИД = Н_УЧЕНИКИ.ЧЛВК_ИД
WHERE Н_УЧЕНИКИ.ПРИЗНАК = 'отчисл'
AND Н_УЧЕНИКИ.КОНЕЦ_ПО_ПРИКАЗУ > '2012-09-01'
AND Н_УЧЕНИКИ.ЧЛВК_ИД IN (
	SELECT Н_УЧЕНИКИ.ЧЛВК_ИД
	FROM Н_УЧЕНИКИ
	JOIN Н_ПЛАНЫ ON Н_УЧЕНИКИ.ПЛАН_ИД = Н_ПЛАНЫ.ИД
	WHERE Н_ПЛАНЫ.ФО_ИД = '3' );

/*
Результат:
 ГРУППА | ИД | ФАМИЛИЯ | ИМЯ | ОТЧЕСТВО | В_СВЯЗИ_С
--------+----+---------+-----+----------+-----------
(0 строк)

Потому что среди планов нет ни одного для заочного обучения (ИД = 3):
 ФО_ИД | count
-------+-------
     1 |   618
     2 |    34
(2 строки)
Если применить этот же запрос для другой ФО (1 или 2), то значений будет много.

Я предполагаю, что "номер пункта приказа" это Н_УЧЕНИКИ.В_СВЯЗИ_С.
Я предполагаю, что дата отчисления студента, это Н_УЧЕНИКИ.КОНЕЦ_ПО_ПРИКАЗУ.
*/
